---
kind: method
id: M:Autodesk.Revit.UI.FamilyInstancePlacingArgs.Dispose
source: html/38235731-f339-9f4d-24f4-49aea5b71187.htm
---
# Autodesk.Revit.UI.FamilyInstancePlacingArgs.Dispose Method

Releases all resources used by the FamilyInstancePlacingArgs

## Syntax (C#)
```csharp
public void Dispose()
```